In [30]:
# # 문제 01 유형(DataSet_01.csv 이용)
#
# 구분자 : comma(“,”), 4,572 Rows, 5 Columns, UTF-8 인코딩
#
# 글로벌 전자제품 제조회사에서 효과적인 마케팅 방법을 찾기
# 위해서 채널별 마케팅 예산과 매출금액과의 관계를 분석하고자
# 한다.
# 컬 럼 / 정 의  /   Type
# TV   /     TV 마케팅 예산 (억원)  /   Double
# Radio / 라디오 마케팅 예산 (억원)  /   Double
# Social_Media / 소셜미디어 마케팅 예산 (억원)  / Double
# Influencer / 인플루언서 마케팅
# (인플루언서의 영향력 크기에 따라 Mega / Macro / Micro /
# Nano) / String

# SALES / 매출액 / Double

In [31]:
# 1. 데이터 세트 내에 총 결측값의 개수는 몇 개인가? (답안 예시) 23

In [32]:
import pandas as pd
import numpy as np

In [33]:
df = pd.read_csv('../Dataset/Dataset_01.csv')
df.head()

     TV      Radio  Social_Media Influencer       Sales
0  16.0   6.566231      2.907983       Mega   54.732757
1  13.0   9.237765      2.409567       Mega   46.677897
2  41.0  15.886446      2.913410       Mega  150.177829
3  83.0  30.020028      6.922304       Mega  298.246340
4  15.0   8.437408      1.405998      Micro   56.594181

In [34]:
df.isnull().sum().sum()

26

In [35]:
# 답 : 26

In [38]:
# 2. TV, Radio, Social Media 등 세 가지 다른 마케팅 채널의 예산과 매출액과의 상관분석을
# 통하여 각 채널이 매출에 어느 정도 연관이 있는지 알아보고자 한다.
# - 매출액과 가장 강한 상관관계를 가지고 있는 채널의 상관계수를 소수점 5번째
# 자리에서 반올림하여 소수점 넷째 자리까지 기술하시오. (답안 예시) 0.1234

In [42]:
df[['TV', 'Radio', 'Social_Media', 'Sales']].corr().drop('Sales')['Sales'].abs().max()

0.999497444941335

In [43]:
# 답 : 0.9995

In [44]:
# 3. 매출액을 종속변수, TV, Radio, Social Media의 예산을 독립변수로 하여 회귀분석을
# 수행하였을 때, 세 개의 독립변수의 회귀계수를 큰 것에서부터 작은 것 순으로
# 기술하시오.
# - 분석 시 결측치가 포함된 행은 제거한 후 진행하며, 회귀계수는 소수점 넷째 자리
# 이하는 버리고 소수점 셋째 자리까지 기술하시오. (답안 예시) 0.123

In [51]:
base = df.copy()

In [52]:
base = base.dropna()

In [53]:
from statsmodels.formula.api import ols

In [54]:
var_list = ['TV', 'Radio', 'Social_Media']

In [55]:
form = 'Sales~' + '+'.join(var_list)

In [56]:
model = ols(form, data=base).fit()

In [60]:
model.params.drop('Intercept').sort_values(ascending=False)

TV              3.562570
Social_Media    0.004964
Radio          -0.003970
dtype: float64

In [61]:
# 답 : 3.562, 0.004, -0.003

In [62]:
# # 문제 02 유형(DataSet_02.csv 이용)
# 구분자 : comma(“,”), 200 Rows, 6 Columns, UTF-8 인코딩

# 환자의 상태와 그에 따라 처방된 약에 대한 정보를 분석하고자한다
#
# 컬 럼 / 정 의  / Type
# Age  / 연령 / Integer
# Sex / 성별 / String
# BP / 혈압 레벨 / String
# Cholesterol / 콜레스테롤 레벨 /  String
# Na_to_k / 혈액 내 칼륨에 대비한 나트륨 비율 / Double
# Drug / Drug Type / String

In [63]:
import pandas as pd
import numpy as np

In [65]:
df = pd.read_csv('../Dataset/Dataset_02.csv')
df.head(3)

   Age Sex    BP Cholesterol  Na_to_K   Drug
0   23   F  HIGH        HIGH   25.355  DrugY
1   47   M   LOW        HIGH   13.093  drugC
2   47   M   LOW        HIGH   10.114  drugC

In [66]:
# 1.해당 데이터에 대한 EDA를 수행하고, 여성으로 혈압이 High, Cholesterol이 Normal인
# 환자의 전체에 대비한 비율이 얼마인지 소수점 네 번째 자리에서 반올림하여 소수점 셋째
# 자리까지 기술하시오. (답안 예시) 0.123

In [74]:
df[['Sex', 'BP', 'Cholesterol']].value_counts(normalize=True)

Sex  BP      Cholesterol
F    HIGH    NORMAL         0.105
M    HIGH    NORMAL         0.105
     LOW     NORMAL         0.095
     NORMAL  HIGH           0.095
F    NORMAL  HIGH           0.090
M    HIGH    HIGH           0.090
F    HIGH    HIGH           0.085
M    LOW     HIGH           0.085
F    LOW     HIGH           0.070
             NORMAL         0.070
     NORMAL  NORMAL         0.060
M    NORMAL  NORMAL         0.050
dtype: float64

In [68]:
q1 = pd.crosstab(index=[df['Sex'], df['BP']], columns=df['Cholesterol'], normalize=True)
q1

Cholesterol   HIGH  NORMAL
Sex BP
F   HIGH     0.085   0.105
    LOW      0.070   0.070
    NORMAL   0.090   0.060
M   HIGH     0.090   0.105
    LOW      0.085   0.095
    NORMAL   0.095   0.050

In [75]:
# 답 : 0.105

In [76]:
# 2. Age, Sex, BP, Cholesterol 및 Na_to_k 값이 Drug 타입에 영향을 미치는지 확인하기
# 위하여 아래와 같이 데이터를 변환하고 분석을 수행하시오. 
# - Age_gr 컬럼을 만들고, Age가 20 미만은 ‘10’, 20부터 30 미만은 ‘20’, 30부터 40 미만은
# ‘30’, 40부터 50 미만은 ‘40’, 50부터 60 미만은 ‘50’, 60이상은 ‘60’으로 변환하시오. 
# - Na_K_gr 컬럼을 만들고 Na_to_k 값이 10이하는 ‘Lv1’, 20이하는 ‘Lv2’, 30이하는 ‘Lv3’, 30 
# 초과는 ‘Lv4’로 변환하시오.
# - Sex, BP, Cholesterol, Age_gr, Na_K_gr이 Drug 변수와 영향이 있는지 독립성 검정을
# 수행하시오.
# - 검정 수행 결과, Drug 타입과 연관성이 있는 변수는 몇 개인가? 연관성이 있는 변수
# 가운데 가장 큰 p-value를 찾아 소수점 여섯 번째 자리 이하는 버리고 소수점 다섯
# 번째 자리까지 기술하시오.
# (답안 예시) 3, 1.23456

In [77]:
df['Age_gr'] = np.where(df['Age'] < 20, 10,
                       np.where(df['Age'] < 30, 20,
                               np.where(df['Age'] < 40, 30,
                                       np.where(df['Age'] < 50, 40,
                                               np.where(df['Age'] < 60, 50, 60)))))

df['Na_K_gr'] = np.where(df['Na_to_K'] <= 10, 'Lv1',
                        np.where(df['Na_to_K'] <= 20, 'Lv2',
                                np.where(df['Na_to_K'] <= 30, 'Lv3', 'Lv4')))

df.head()

   Age Sex      BP Cholesterol  Na_to_K   Drug  Age_gr Na_K_gr
0   23   F    HIGH        HIGH   25.355  DrugY      20     Lv3
1   47   M     LOW        HIGH   13.093  drugC      40     Lv2
2   47   M     LOW        HIGH   10.114  drugC      40     Lv2
3   28   F  NORMAL        HIGH    7.798  drugX      20     Lv1
4   61   F     LOW        HIGH   18.043  DrugY      60     Lv2

In [78]:
df.columns

Index(['Age', 'Sex', 'BP', 'Cholesterol', 'Na_to_K', 'Drug', 'Age_gr',
       'Na_K_gr'],
      dtype='object')

In [79]:
var_list = ['Sex', 'BP', 'Cholesterol', 'Age_gr', 'Na_K_gr']

In [80]:
from scipy.stats import chi2_contingency

In [83]:
tab = pd.crosstab(index=df['Sex'], columns=df['Drug'])
tab

Drug  DrugY  drugA  drugB  drugC  drugX
Sex
F        47      9      6      7     27
M        44     14     10      9     27

In [86]:
chi2_contingency(tab)

(2.119248418109203,
 0.7138369773987128,
 4,
 array([[43.68, 11.04,  7.68,  7.68, 25.92],
        [47.32, 11.96,  8.32,  8.32, 28.08]]))

In [93]:
result = []
for i in var_list:
    temp = pd.crosstab(index=df[i], columns=df['Drug'])
    result.append([i, chi2_contingency(temp)[1]])
result = pd.DataFrame(result, columns=['var', 'pvalue'])
result

           var        pvalue
0          Sex  7.138370e-01
1           BP  5.041733e-27
2  Cholesterol  5.962588e-04
3       Age_gr  7.010113e-04
4      Na_K_gr  1.125464e-14

In [97]:
result[result.pvalue < 0.05].count()

var       4
pvalue    4
dtype: int64

In [98]:
result[result.pvalue < 0.05].max()

var        Na_K_gr
pvalue    0.000701
dtype: object

In [99]:
# 답 : 4, 0.00070

In [100]:
# 3.Sex, BP, Cholesterol 등 세 개의 변수를 다음과 같이 변환하고 의사결정나무를 이용한
# 분석을 수행하시오.
# - Sex는 M을 0, F를 1로 변환하여 Sex_cd 변수 생성
# - BP는 LOW는 0, NORMAL은 1 그리고 HIGH는 2로 변환하여 BP_cd 변수 생성
# - Cholesterol은 NORMAL은 0, HIGH는 1로 변환하여 Ch_cd 생성
# - Age, Na_to_k, Sex_cd, BP_cd, Ch_cd를 Feature로, Drug을 Label로 하여 의사결정나무를
# 수행하고 Root Node의 split feature와 split value를 기술하시오. 
# 이 때 split value는 소수점 셋째 자리까지 반올림하여 기술하시오. (답안 예시) Age, 
# 12.345

In [101]:
df.head()

   Age Sex      BP Cholesterol  Na_to_K   Drug  Age_gr Na_K_gr
0   23   F    HIGH        HIGH   25.355  DrugY      20     Lv3
1   47   M     LOW        HIGH   13.093  drugC      40     Lv2
2   47   M     LOW        HIGH   10.114  drugC      40     Lv2
3   28   F  NORMAL        HIGH    7.798  drugX      20     Lv1
4   61   F     LOW        HIGH   18.043  DrugY      60     Lv2

In [102]:
df['Sex_cd'] = np.where(df['Sex']=='M', 0, 1)
df['BP_cd'] = np.where(df['BP'] == 'LOW', 0,
                      np.where(df['BP'] == 'NORMAL', 1, 2))
df['Ch_cd'] = np.where(df['Cholesterol'] == 'NORMAL', 0, 1)
df.head()

,Age,Sex,BP,Cholesterol,Na_to_K,Drug,Age_gr,Na_K_gr,Sex_cd,BP_cd,Ch_cd
0,23,F,HIGH,HIGH,25.355,DrugY,20,Lv3,1,2,1
1,47,M,LOW,HIGH,13.093,drugC,40,Lv2,0,0,1
2,47,M,LOW,HIGH,10.114,drugC,40,Lv2,0,0,1
3,28,F,NORMAL,HIGH,7.798,drugX,20,Lv1,1,1,1
4,61,F,LOW,HIGH,18.043,DrugY,60,Lv2,1,0,1

In [103]:
df.columns

Index(['Age', 'Sex', 'BP', 'Cholesterol', 'Na_to_K', 'Drug', 'Age_gr',
       'Na_K_gr', 'Sex_cd', 'BP_cd', 'Ch_cd'],
      dtype='object')

In [104]:
var_list = ['Age', 'Na_to_K', 'Sex_cd', 'BP_cd', 'Ch_cd']

In [105]:
from sklearn.tree import DecisionTreeClassifier, export_text

In [106]:
model = DecisionTreeClassifier()

In [107]:
model.fit(df[var_list], df['Drug'])

DecisionTreeClassifier()

In [110]:
export_text(model, decimals=3, feature_names=var_list)

'|--- Na_to_K <= 14.829\n|   |--- BP_cd <= 1.500\n|   |   |--- BP_cd <= 0.500\n|   |   |   |--- Ch_cd <= 0.500\n|   |   |   |   |--- class: drugX\n|   |   |   |--- Ch_cd >  0.500\n|   |   |   |   |--- class: drugC\n|   |   |--- BP_cd >  0.500\n|   |   |   |--- class: drugX\n|   |--- BP_cd >  1.500\n|   |   |--- Age <= 50.500\n|   |   |   |--- class: drugA\n|   |   |--- Age >  50.500\n|   |   |   |--- class: drugB\n|--- Na_to_K >  14.829\n|   |--- class: DrugY\n'

In [111]:
# 답 : Na_to_K, 14.829

In [112]:
# # 문제 03 유형(DataSet_03.csv 이용)
# 
# 구분자 : comma(“,”), 5,001 Rows, 8 Columns, UTF-8 인코딩
# 안경 체인을 운영하고 있는 한 회사에서 고객 사진을 바탕으로 안경의 사이즈를
# 맞춤 제작하는 비즈니스를 기획하고 있다. 우선 데이터만으로 고객의 성별을
# 파악하는 것이 가능할 지를 연구하고자 한다.
#
# 컬 럼 / 정 의 / Type
# long_hair / 머리카락 길이 (0 – 길지 않은 경우 / 1 – 긴
# 경우) / Integer
# forehead_width_cm / 이마의 폭 (cm) / Double
# forehead_height_cm / 이마의 높이 (cm) / Double
# nose_wide / 코의 넓이 (0 – 넓지 않은 경우 / 1 – 넓은 경우) / Integer
# nose_long / 코의 길이 (0 – 길지 않은 경우 / 1 – 긴 경우) / Integer
# lips_thin / 입술이 얇은지 여부 0 – 얇지 않은 경우 / 1 –
# 얇은 경우) / Integer
# distance_nose_to_lip_long / 인중의 길이(0 – 인중이 짧은 경우 / 1 – 인중이
# 긴 경우) / Integer
# gender / 성별 (Female / Male) / String

In [113]:
import pandas as pd
import numpy as np

In [114]:
df = pd.read_csv('../Dataset/Dataset_03.csv')
df.head(3)

,long_hair,forehead_width_cm,forehead_height_cm,nose_wide,nose_long,lips_thin,distance_nose_to_lip_long,gender
0,1,11.8,6.1,1,0,1,1,Male
1,0,14.0,5.4,0,0,1,0,Female
2,0,11.8,6.3,1,1,1,1,Male

In [115]:
# 1.이마의 폭(forehead_width_cm)과 높이(forehead_height_cm) 사이의
# 비율(forehead_ratio)에 대해서 평균으로부터 3 표준편차 밖의 경우를 이상치로
# 정의할 때, 이상치에 해당하는 데이터는 몇 개인가? (답안 예시) 10

In [116]:
df['forehead_ratio'] = df['forehead_width_cm'] / df['forehead_height_cm']
df.head()

,long_hair,forehead_width_cm,forehead_height_cm,nose_wide,nose_long,lips_thin,distance_nose_to_lip_long,gender,forehead_ratio
0,1,11.8,6.1,1,0,1,1,Male,1.934426
1,0,14.0,5.4,0,0,1,0,Female,2.592593
2,0,11.8,6.3,1,1,1,1,Male,1.873016
3,0,14.4,6.1,0,1,1,1,Male,2.360656
4,1,13.5,5.9,0,0,0,0,Female,2.288136

In [117]:
ord1 = df['forehead_ratio'].mean() - df['forehead_ratio'].std() * 3
ord2 = df['forehead_ratio'].mean() + df['forehead_ratio'].std() * 3

In [126]:
df['forehead_ratio'][((df['forehead_ratio'] < ord1) | (df['forehead_ratio'] > ord2))]

1641    3.039216
1817    3.039216
4948    3.039216
Name: forehead_ratio, dtype: float64

In [127]:
# 답 : 3

In [128]:
# 2.성별에 따라 forehead_ratio 평균에 차이가 있는지 적절한 통계 검정을 수행하시오.
# - 검정은 이분산을 가정하고 수행한다.
# - 검정통계량의 추정치는 절대값을 취한 후 소수점 셋째 자리까지 반올림하여
# 기술하시오.
# - 신뢰수준 99%에서 양측 검정을 수행하고 결과는 귀무가설 기각의 경우 Y로, 그렇지
# 않을 경우 N으로 답하시오. (답안 예시) 1.234, Y

In [130]:
tab_m = df[df['gender'] == 'Male']['forehead_ratio']
tab_f = df[df['gender'] == 'Female']['forehead_ratio']

In [131]:
from scipy.stats import ttest_ind

In [132]:
ttest_ind(tab_m, tab_f, equal_var=False)

Ttest_indResult(statistic=2.9994984197511543, pvalue=0.0027186702390657176)

In [135]:
round(ttest_ind(tab_m, tab_f, equal_var=False)[0], 3)

2.999

In [136]:
ttest_ind(tab_m, tab_f, equal_var=False)[1] < 0.05

True

In [137]:
# 답 : 2.999, Y

In [138]:
# 3.주어진 데이터를 사용하여 성별을 구분할 수 있는지 로지스틱 회귀분석을 적용하여
# 알아 보고자 한다. 
# - 데이터를 7대 3으로 나누어 각각 Train과 Test set로 사용한다. 이 때 seed는 123으로
# 한다.
# - 원 데이터에 있는 7개의 변수만 Feature로 사용하고 gender를 label로 사용한다.
# (forehead_ratio는 사용하지 않음)
# - 로지스틱 회귀분석 예측 함수와 Test dataset를 사용하여 예측을 수행하고 정확도를
# 평가한다. 이 때 임계값은 0.5를 사용한다. 
# - Male의 Precision 값을 소수점 둘째 자리까지 반올림하여 기술하시오. (답안 예시) 
# 0.12
# 
# 
# (참고) 
# from sklearn.linear_model import LogisticRegression
# from sklearn.model_selection import train_test_split
# from sklearn import metrics
# train_test_split 의 random_state = 123

In [140]:
df.head(3)

,long_hair,forehead_width_cm,forehead_height_cm,nose_wide,nose_long,lips_thin,distance_nose_to_lip_long,gender,forehead_ratio
0,1,11.8,6.1,1,0,1,1,Male,1.934426
1,0,14.0,5.4,0,0,1,0,Female,2.592593
2,0,11.8,6.3,1,1,1,1,Male,1.873016

In [141]:
df.columns

Index(['long_hair', 'forehead_width_cm', 'forehead_height_cm', 'nose_wide',
       'nose_long', 'lips_thin', 'distance_nose_to_lip_long', 'gender',
       'forehead_ratio'],
      dtype='object')

In [143]:
var_list = ['long_hair', 'forehead_width_cm', 'forehead_height_cm', 'nose_wide', 'nose_long',
            'lips_thin', 'distance_nose_to_lip_long']

In [156]:
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split
from sklearn.metrics import classification_report, precision_score

In [145]:
x_train, x_test, y_train, y_test = train_test_split(df[var_list], df['gender'], random_state=123, test_size=0.3)

In [148]:
model = LogisticRegression(random_state=123)

In [149]:
model.fit(x_train, y_train)

LogisticRegression(random_state=123)

In [152]:
pred = model.predict(x_test)

In [154]:
print(classification_report(y_test, pred))

              precision    recall  f1-score   support

      Female       0.97      0.96      0.96       743
        Male       0.96      0.97      0.97       758

    accuracy                           0.97      1501
   macro avg       0.97      0.97      0.97      1501
weighted avg       0.97      0.97      0.97      1501

In [155]:
# 답 : 0.96

In [158]:
precision_score(y_test, pred, pos_label='Male')

0.9596354166666666

In [159]:
# # 문제 04 유형(DataSet_04.csv 이용)
#
# 구분자 : comma(“,”), 6,718 Rows, 4 Columns, UTF-8 인코딩

# 한국인의 식생활 변화가 건강에 미치는 영향을 분석하기에 앞서 육류
# 소비량에 대한 분석을 하려고 한다. 확보한 데이터는 세계 각국의 1인당
# 육류 소비량 데이터로 아래와 같은 내용을 담고 있다.

# 컬 럼 / 정 의 / Type
# LOCATION / 국가명 / String
# SUBJECT / 육류 종류 (BEEF / PIG / POULTRY / SHEEP) / String
# TIME / 연도 (1990 ~ 2026) / Integer
# Value / 1인당 육류 소비량 (KG) / Double
# =============================================================================
# =============================================================================

# (참고)
# #1
# import pandas as pd
# import numpy as np
# #2
# from scipy.stats import ttest_rel
# #3
# from sklearn.linear_model import LinearRegression

In [160]:
import pandas as pd
import numpy as np

In [161]:
# 1.한국인의 1인당 육류 소비량이 해가 갈수록 증가하는 것으로 보여 상관분석을 통하여
# 확인하려고 한다.
# - 데이터 파일로부터 한국 데이터만 추출한다. 한국은 KOR로 표기되어 있다.
# - 년도별 육류 소비량 합계를 구하여 TIME과 Value간의 상관분석을 수행하고
# 상관계수를 소수점 셋째 자리에서 반올림하여 소수점 둘째 자리까지만 기술하시오.
# (답안 예시) 0.55

In [162]:
# (참고)
# #1
# import pandas as pd
# import numpy as np
# #2
# from scipy.stats import ttest_rel
# #3
# from sklearn.linear_model import LinearRegression

In [163]:
df=pd.read_csv('../Dataset/Dataset_04.csv')
df.head(3)

  LOCATION SUBJECT  TIME      Value
0      AUS    BEEF  1991  27.721815
1      AUS    BEEF  1992  26.199591
2      AUS    BEEF  1993  26.169094

In [164]:
df_kor = df[df.LOCATION=='KOR']
df_kor.head(3)

    LOCATION SUBJECT  TIME     Value
442      KOR    BEEF  1991  5.085481
443      KOR    BEEF  1992  5.685434
444      KOR    BEEF  1993  5.325765

In [176]:
tab = df_kor.groupby('TIME')['Value'].sum().reset_index()
tab.head(3)

   TIME      Value
0  1990   5.774255
1  1991  21.911207
2  1992  26.901769

In [177]:
tab.corr()

           TIME     Value
TIME   1.000000  0.960124
Value  0.960124  1.000000

In [178]:
# 답 : 0.96

In [179]:
# 2. 한국 인근 국가 가운데 식생의 유사성이 상대적으로 높은 일본(JPN)과 비교하여, 연도별
# 소비량에 평균 차이가 있는지 분석하고자 한다.
# - 두 국가의 육류별 소비량을 연도기준으로 비교하는 대응표본 t 검정을 수행하시오.
# - 두 국가 간의 연도별 소비량 차이가 없는 것으로 판단할 수 있는 육류 종류를 모두
# 적으시오. (알파벳 순서) (답안 예시) BEEF, PIG, POULTRY, SHEEP

In [180]:
df_jpn = df[df.LOCATION == 'JPN']
df_jpn.head(3)

    LOCATION SUBJECT  TIME     Value
294      JPN    BEEF  1990  6.111035
295      JPN    BEEF  1991  6.517055
296      JPN    BEEF  1992  6.766244

In [183]:
df2 = df[df.LOCATION.isin(['KOR', 'JPN'])]
df2.head(3)

    LOCATION SUBJECT  TIME     Value
294      JPN    BEEF  1990  6.111035
295      JPN    BEEF  1991  6.517055
296      JPN    BEEF  1992  6.766244

In [186]:
df2.SUBJECT.unique()

array(['BEEF', 'PIG', 'POULTRY', 'SHEEP'], dtype=object)

In [187]:
var_list = ['BEEF', 'PIG', 'POULTRY', 'SHEEP']

In [188]:
from scipy.stats import ttest_rel

In [200]:
result = []
for i in var_list:
    temp = df[df.SUBJECT == i]
    tab = pd.pivot_table(temp, index='TIME', columns='LOCATION', values='Value').dropna()
    t = ttest_rel(tab['KOR'], tab['JPN'])
    result.append([t.pvalue, i])
result = pd.DataFrame(result, columns=['pvalue', 'var'])

In [201]:
result

         pvalue      var
0  2.643163e-08     BEEF
1  8.562576e-12      PIG
2  7.947090e-01  POULTRY
3  1.668021e-04    SHEEP

In [202]:
result[result.pvalue >= 0.05]

     pvalue      var
2  0.794709  POULTRY

In [203]:
# 답 : POULTRY

In [204]:
# 3.(한국만 포함한 데이터에서) Time을 독립변수로, Value를 종속변수로 하여 육류
# 종류(SUBJECT) 별로 회귀분석을 수행하였을 때, 가장 높은 결정계수를 가진 모델의
# 학습오차 중 MAPE를 반올림하여 소수점 둘째 자리까지 기술하시오. (답안 예시) 21.12
# (MAPE : Mean Absolute Percentage Error, 평균 절대 백분율 오차)
# (MAPE = Σ ( | y - y ̂ | / y ) * 100/n ))

In [207]:
from sklearn.linear_model import LinearRegression

In [209]:
df_kor.head()

    LOCATION SUBJECT  TIME     Value
442      KOR    BEEF  1991  5.085481
443      KOR    BEEF  1992  5.685434
444      KOR    BEEF  1993  5.325765
445      KOR    BEEF  1994  5.698819
446      KOR    BEEF  1995  6.568429

In [219]:
result = []
for i in var_list:
    temp = df_kor[df_kor['SUBJECT']==i]
    model = LinearRegression()
    model.fit(temp[['TIME']], temp['Value'])
    r2 = model.score(temp[['TIME']], temp['Value'])
    pred = model.predict(temp[['TIME']])
    mape = (abs(temp['Value'] - pred) / temp['Value']).sum() * 100 / len(temp)
    result.append([i, r2, mape])
result = pd.DataFrame(result, columns=['var', 'r2', 'mape'])
result

       var        r2       mape
0     BEEF  0.835456   7.310893
1      PIG  0.940681   5.634980
2  POULTRY  0.951498   5.783358
3    SHEEP  0.004083  33.347966

In [220]:
result.r2.idxmax()

2

In [221]:
# 답 : 5.78